// git log просмотр сохранений
// git add <file>... to update what will be commited
// git checkout -- <file>... to discard changes in working directory
// git add -A добавить все файлы
// git commit -a -m"..." сохранение + пометка что изменилось    
// git push отправка файлов на удалённый репозиторий (на сайт)
// git pull обнавление репозитория на компе (если кто-то работал с этим проектом надо ввести это чтобы все изменеия 
// перенеслись сюда)
// wq! ???
// файл gitignore (не скачивает/закидвает_на_сайт некоторые файлы не нужные(моды настройки и тп))